Ran Plan for 6 projects:

1. project: `marketplace-ecs-scheduler-prod` dir: `terraform/environments/prod/ecs-scheduler` workspace: `default`
1. project: `marketplace-sqs-prod` dir: `terraform/environments/prod/sqs` workspace: `default`
1. project: `marketplace-ecs-worker-prod` dir: `terraform/environments/prod/ecs-worker` workspace: `default`
1. project: `marketplace-ecs-scheduler-stage` dir: `terraform/environments/stage/ecs-scheduler` workspace: `default`
1. project: `marketplace-sqs-stage` dir: `terraform/environments/stage/sqs` workspace: `default`
1. project: `marketplace-ecs-worker-stage` dir: `terraform/environments/stage/ecs-worker` workspace: `default`
---

### 1. project: `marketplace-ecs-scheduler-prod` dir: `terraform/environments/prod/ecs-scheduler` workspace: `default`
**Plan Error**
<details><summary>Show Output</summary>

```
running "/home/atlantis/.atlantis/bin/terraform1.8.1 plan -input=false -refresh -out \"/home/atlantis/.atlantis/repos/ryu-qqq/MarketPlace/51/default/terraform/environments/prod/ecs-scheduler/marketplace-ecs-scheduler-prod-default.tfplan\"" in "/home/atlantis/.atlantis/repos/ryu-qqq/MarketPlace/51/default/terraform/environments/prod/ecs-scheduler": exit status 1
data.aws_ssm_parameter.legacy_db_password: Reading...
data.aws_ssm_parameter.sqs_intelligence_aggregation_queue_url: Reading...
data.aws_ssm_parameter.sqs_intelligence_orchestration_queue_url: Reading...
data.aws_ssm_parameter.amp_workspace_arn: Reading...
data.aws_ssm_parameter.sqs_intelligence_option_analysis_queue_url: Reading...
data.aws_ssm_parameter.fileflow_service_token: Reading...
data.aws_ssm_parameter.rds_proxy_endpoint: Reading...
data.aws_ssm_parameter.ses_sender_email: Reading...
module.ecs_service.data.aws_caller_identity.current: Reading...
data.aws_ssm_parameter.sqs_intelligence_notice_analysis_queue_url: Reading...
module.ecs_service.data.aws_caller_identity.current: Read complete after 0s [id=646886795421]
module.scheduler_task_execution_role.data.aws_region.current: Reading...
module.scheduler_task_execution_role.data.aws_region.current: Read complete after 0s [id=ap-northeast-2]
data.aws_ssm_parameter.sqs_intelligence_description_analysis_queue_url: Reading...
data.aws_ssm_parameter.amp_workspace_arn: Read complete after 0s [id=/shared/monitoring/amp-workspace-arn]
module.scheduler_task_execution_role.data.aws_caller_identity.current: Reading...
module.scheduler_task_role.data.aws_caller_identity.current: Reading...
data.aws_ssm_parameter.vpc_id: Reading...
data.aws_ssm_parameter.rds_proxy_endpoint: Read complete after 0s [id=/shared/rds/proxy-endpoint]
data.aws_ssm_parameter.ses_sender_email: Read complete after 0s [id=/marketplace/ses/sender-email]
data.aws_ssm_parameter.naver_commerce_client_id: Reading...
module.scheduler_task_execution_role.data.aws_caller_identity.current: Read complete after 0s [id=646886795421]
data.aws_ssm_parameter.authhub_service_token: Reading...
data.aws_ecs_cluster.main: Reading...
data.aws_ssm_parameter.legacy_db_password: Read complete after 0s [id=/marketplace/prod/legacy-db-password]
module.scheduler_task_execution_role.aws_iam_role.this: Refreshing state... [id=marketplace-scheduler-execution-role-prod]
data.aws_ssm_parameter.sentry_dsn: Reading...
data.aws_ssm_parameter.sqs_outbound_sync_queue_url: Reading...
module.scheduler_task_role.data.aws_caller_identity.current: Read complete after 0s [id=646886795421]
data.aws_ssm_parameter.amp_remote_write_url: Reading...
data.aws_ecr_repository.scheduler: Reading...
data.aws_ssm_parameter.fileflow_service_token: Read complete after 0s [id=/shared/security/service-token-secret]
module.scheduler_task_role.data.aws_region.current: Reading...
module.scheduler_task_role.data.aws_region.current: Read complete after 0s [id=ap-northeast-2]
module.scheduler_task_role.aws_iam_role.this: Refreshing state... [id=marketplace-scheduler-task-role-prod]
data.aws_ssm_parameter.vpc_id: Read complete after 0s [id=/shared/network/vpc-id]
module.ecs_service.data.aws_region.current: Reading...
module.ecs_service.data.aws_region.current: Read complete after 0s [id=ap-northeast-2]
data.aws_ssm_parameter.naver_commerce_client_id: Read complete after 0s [id=/naver-commerce/prod/client-id]
data.aws_ssm_parameter.service_discovery_namespace_id: Reading...
data.aws_ssm_parameter.openai_api_key: Reading...
data.aws_ssm_parameter.amp_remote_write_url: Read complete after 0s [id=/shared/monitoring/amp-remote-write-url]
data.aws_secretsmanager_secret.rds: Reading...
data.aws_ssm_parameter.private_subnets: Reading...
data.aws_ssm_parameter.authhub_service_token: Read complete after 0s [id=/authhub/security/service-token-secret]
data.aws_caller_identity.current: Reading...
data.aws_ssm_parameter.sentry_dsn: Read complete after 0s [id=/marketplace/sentry/dsn]
data.aws_ssm_parameter.naver_commerce_client_secret: Reading...
data.aws_ssm_parameter.service_discovery_namespace_id: Read complete after 0s [id=/shared/service-discovery/namespace-id]
data.aws_ssm_parameter.private_subnets: Read complete after 0s [id=/shared/network/private-subnets]
data.aws_ecs_cluster.main: Read complete after 0s [id=arn:aws:ecs:ap-northeast-2:646886795421:cluster/marketplace-cluster-prod]
data.aws_vpc.main: Reading...
data.aws_caller_identity.current: Read complete after 0s [id=646886795421]
module.ecs_security_group.aws_security_group.this: Refreshing state... [id=sg-0db7112d8758d2f1e]
data.aws_secretsmanager_secret.rds: Read complete after 0s [id=arn:aws:secretsmanager:ap-northeast-2:646886795421:secret:marketplace/rds/credentials-MGeUIP]
data.aws_ssm_parameter.openai_api_key: Read complete after 0s [id=/marketplace/openai/api-key]
module.ecs_service.aws_service_discovery_service.this[0]: Refreshing state... [id=srv-r5peohzssqtwvsxn]
data.aws_secretsmanager_secret_version.rds: Reading...
aws_kms_key.logs: Refreshing state... [id=cb0234ca-88c3-46e3-87ed-22e98e4789a8]
data.aws_ssm_parameter.naver_commerce_client_secret: Read complete after 0s [id=/naver-commerce/prod/client-secret]
data.aws_secretsmanager_secret_version.rds: Read complete after 0s [id=arn:aws:secretsmanager:ap-northeast-2:646886795421:secret:marketplace/rds/credentials-MGeUIP|AWSCURRENT]
aws_kms_alias.logs: Refreshing state... [id=alias/marketplace-scheduler-logs-prod]
module.scheduler_logs.aws_cloudwatch_log_group.this: Refreshing state... [id=/aws/ecs/marketplace-scheduler-prod/application]
module.ecs_security_group.aws_vpc_security_group_egress_rule.default[0]: Refreshing state... [id=sgr-0e9f264d683a2504d]
data.aws_ecr_repository.scheduler: Read complete after 0s [id=marketplace-scheduler-prod]
data.aws_vpc.main: Read complete after 0s
module.ecs_security_group.aws_vpc_security_group_ingress_rule.custom["0"]: Refreshing state... [id=sgr-009401776e60bd2c4]
module.scheduler_task_execution_role.aws_iam_role_policy_attachment.aws-managed["arn:aws:iam::aws:policy/service-role/AmazonECSTaskExecutionRolePolicy"]: Refreshing state... [id=marketplace-scheduler-execution-role-prod-20260207055131463000000002]
module.scheduler_task_execution_role.aws_iam_role_policy.custom["ssm-access"]: Refreshing state... [id=marketplace-scheduler-execution-role-prod:marketplace-scheduler-execution-role-prod-ssm-access]
module.scheduler_task_execution_role.aws_iam_role_policy.secrets-manager[0]: Refreshing state... [id=marketplace-scheduler-execution-role-prod:marketplace-scheduler-execution-role-prod-secrets-manager]
module.scheduler_task_role.aws_iam_role_policy.custom["ses-access"]: Refreshing state... [id=marketplace-scheduler-task-role-prod:marketplace-scheduler-task-role-prod-ses-access]
module.scheduler_task_role.aws_iam_role_policy.custom["adot-amp-access"]: Refreshing state... [id=marketplace-scheduler-task-role-prod:marketplace-scheduler-task-role-prod-adot-amp-access]
module.scheduler_task_role.aws_iam_role_policy.custom["sqs-access"]: Refreshing state... [id=marketplace-scheduler-task-role-prod:marketplace-scheduler-task-role-prod-sqs-access]

Planning failed. Terraform encountered an error while generating this plan.

╷
│ Error: reading SSM Parameter (/marketplace/prod/sqs/outbound-sync-queue-url): couldn't find resource
│ 
│   with data.aws_ssm_parameter.sqs_outbound_sync_queue_url,
│   on provider.tf line 157, in data "aws_ssm_parameter" "sqs_outbound_sync_queue_url":
│  157: data "aws_ssm_parameter" "sqs_outbound_sync_queue_url" {
│ 
╵
╷
│ Error: reading SSM Parameter (/marketplace/prod/sqs/intelligence-orchestration-queue-url): couldn't find resource
│ 
│   with data.aws_ssm_parameter.sqs_intelligence_orchestration_queue_url,
│   on provider.tf line 164, in data "aws_ssm_parameter" "sqs_intelligence_orchestration_queue_url":
│  164: data "aws_ssm_parameter" "sqs_intelligence_orchestration_queue_url" {
│ 
╵
╷
│ Error: reading SSM Parameter (/marketplace/prod/sqs/intelligence-description-analysis-queue-url): couldn't find resource
│ 
│   with data.aws_ssm_parameter.sqs_intelligence_description_analysis_queue_url,
│   on provider.tf line 168, in data "aws_ssm_parameter" "sqs_intelligence_description_analysis_queue_url":
│  168: data "aws_ssm_parameter" "sqs_intelligence_description_analysis_queue_url" {
│ 
╵
╷
│ Error: reading SSM Parameter (/marketplace/prod/sqs/intelligence-option-analysis-queue-url): couldn't find resource
│ 
│   with data.aws_ssm_parameter.sqs_intelligence_option_analysis_queue_url,
│   on provider.tf line 172, in data "aws_ssm_parameter" "sqs_intelligence_option_analysis_queue_url":
│  172: data "aws_ssm_parameter" "sqs_intelligence_option_analysis_queue_url" {
│ 
╵
╷
│ Error: reading SSM Parameter (/marketplace/prod/sqs/intelligence-notice-analysis-queue-url): couldn't find resource
│ 
│   with data.aws_ssm_parameter.sqs_intelligence_notice_analysis_queue_url,
│   on provider.tf line 176, in data "aws_ssm_parameter" "sqs_intelligence_notice_analysis_queue_url":
│  176: data "aws_ssm_parameter" "sqs_intelligence_notice_analysis_queue_url" {
│ 
╵
╷
│ Error: reading SSM Parameter (/marketplace/prod/sqs/intelligence-aggregation-queue-url): couldn't find resource
│ 
│   with data.aws_ssm_parameter.sqs_intelligence_aggregation_queue_url,
│   on provider.tf line 180, in data "aws_ssm_parameter" "sqs_intelligence_aggregation_queue_url":
│  180: data "aws_ssm_parameter" "sqs_intelligence_aggregation_queue_url" {
│ 
╵


```
</details>

---
### 2. project: `marketplace-sqs-prod` dir: `terraform/environments/prod/sqs` workspace: `default`
<details><summary>Show Output</summary>

```diff
Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
+ create

Terraform will perform the following actions:

  # aws_ssm_parameter.cancel_outbox_queue_url will be created
+ resource "aws_ssm_parameter" "cancel_outbox_queue_url" {
      + arn            = (known after apply)
      + data_type      = (known after apply)
      + has_value_wo   = (known after apply)
      + id             = (known after apply)
      + insecure_value = (known after apply)
      + key_id         = (known after apply)
      + name           = "/marketplace/prod/sqs/cancel-outbox-queue-url"
      + tags           = {
          + "cost_center"  = "engineering"
          + "data_class"   = "internal"
          + "environment"  = "prod"
          + "owner"        = "platform@ryuqqq.com"
          + "project"      = "marketplace"
          + "service_name" = "marketplace-sqs"
          + "team"         = "platform-team"
        }
      + tags_all       = {
          + "Environment"  = "prod"
          + "ManagedBy"    = "terraform"
          + "Project"      = "marketplace"
          + "cost_center"  = "engineering"
          + "data_class"   = "internal"
          + "environment"  = "prod"
          + "owner"        = "platform@ryuqqq.com"
          + "project"      = "marketplace"
          + "service_name" = "marketplace-sqs"
          + "team"         = "platform-team"
        }
      + tier           = (known after apply)
      + type           = "String"
      + value          = (sensitive value)
      + version        = (known after apply)
    }

  # aws_ssm_parameter.exchange_outbox_queue_url will be created
+ resource "aws_ssm_parameter" "exchange_outbox_queue_url" {
      + arn            = (known after apply)
      + data_type      = (known after apply)
      + has_value_wo   = (known after apply)
      + id             = (known after apply)
      + insecure_value = (known after apply)
      + key_id         = (known after apply)
      + name           = "/marketplace/prod/sqs/exchange-outbox-queue-url"
      + tags           = {
          + "cost_center"  = "engineering"
          + "data_class"   = "internal"
          + "environment"  = "prod"
          + "owner"        = "platform@ryuqqq.com"
          + "project"      = "marketplace"
          + "service_name" = "marketplace-sqs"
          + "team"         = "platform-team"
        }
      + tags_all       = {
          + "Environment"  = "prod"
          + "ManagedBy"    = "terraform"
          + "Project"      = "marketplace"
          + "cost_center"  = "engineering"
          + "data_class"   = "internal"
          + "environment"  = "prod"
          + "owner"        = "platform@ryuqqq.com"
          + "project"      = "marketplace"
          + "service_name" = "marketplace-sqs"
          + "team"         = "platform-team"
        }
      + tier           = (known after apply)
      + type           = "String"
      + value          = (sensitive value)
      + version        = (known after apply)
    }

  # aws_ssm_parameter.inspection_enhancement_dlq_url will be created
+ resource "aws_ssm_parameter" "inspection_enhancement_dlq_url" {
      + arn            = (known after apply)
      + data_type      = (known after apply)
      + has_value_wo   = (known after apply)
      + id             = (known after apply)
      + insecure_value = (known after apply)
      + key_id         = (known after apply)
      + name           = "/marketplace/prod/sqs/inspection-enhancement-dlq-url"
      + tags           = {
          + "cost_center"  = "engineering"
          + "data_class"   = "internal"
          + "environment"  = "prod"
          + "owner"        = "platform@ryuqqq.com"
          + "project"      = "marketplace"
          + "service_name" = "marketplace-sqs"
          + "team"         = "platform-team"
        }
      + tags_all       = {
          + "Environment"  = "prod"
          + "ManagedBy"    = "terraform"
          + "Project"      = "marketplace"
          + "cost_center"  = "engineering"
          + "data_class"   = "internal"
          + "environment"  = "prod"
          + "owner"        = "platform@ryuqqq.com"
          + "project"      = "marketplace"
          + "service_name" = "marketplace-sqs"
          + "team"         = "platform-team"
        }
      + tier           = (known after apply)
      + type           = "String"
      + value          = (sensitive value)
      + version        = (known after apply)
    }

  # aws_ssm_parameter.inspection_enhancement_queue_arn will be created
+ resource "aws_ssm_parameter" "inspection_enhancement_queue_arn" {
      + arn            = (known after apply)
      + data_type      = (known after apply)
      + has_value_wo   = (known after apply)
      + id             = (known after apply)
      + insecure_value = (known after apply)
      + key_id         = (known after apply)
      + name           = "/marketplace/prod/sqs/inspection-enhancement-queue-arn"
      + tags           = {
          + "cost_center"  = "engineering"
          + "data_class"   = "internal"
          + "environment"  = "prod"
          + "owner"        = "platform@ryuqqq.com"
          + "project"      = "marketplace"
          + "service_name" = "marketplace-sqs"
          + "team"         = "platform-team"
        }
      + tags_all       = {
          + "Environment"  = "prod"
          + "ManagedBy"    = "terraform"
          + "Project"      = "marketplace"
          + "cost_center"  = "engineering"
          + "data_class"   = "internal"
          + "environment"  = "prod"
          + "owner"        = "platform@ryuqqq.com"
          + "project"      = "marketplace"
          + "service_name" = "marketplace-sqs"
          + "team"         = "platform-team"
        }
      + tier           = (known after apply)
      + type           = "String"
      + value          = (sensitive value)
      + version        = (known after apply)
    }

  # aws_ssm_parameter.inspection_enhancement_queue_url will be created
+ resource "aws_ssm_parameter" "inspection_enhancement_queue_url" {
      + arn            = (known after apply)
      + data_type      = (known after apply)
      + has_value_wo   = (known after apply)
      + id             = (known after apply)
      + insecure_value = (known after apply)
      + key_id         = (known after apply)
      + name           = "/marketplace/prod/sqs/inspection-enhancement-queue-url"
      + tags           = {
          + "cost_center"  = "engineering"
          + "data_class"   = "internal"
          + "environment"  = "prod"
          + "owner"        = "platform@ryuqqq.com"
          + "project"      = "marketplace"
          + "service_name" = "marketplace-sqs"
          + "team"         = "platform-team"
        }
      + tags_all       = {
          + "Environment"  = "prod"
          + "ManagedBy"    = "terraform"
          + "Project"      = "marketplace"
          + "cost_center"  = "engineering"
          + "data_class"   = "internal"
          + "environment"  = "prod"
          + "owner"        = "platform@ryuqqq.com"
          + "project"      = "marketplace"
          + "service_name" = "marketplace-sqs"
          + "team"         = "platform-team"
        }
      + tier           = (known after apply)
      + type           = "String"
      + value          = (sensitive value)
      + version        = (known after apply)
    }

  # aws_ssm_parameter.inspection_scoring_dlq_url will be created
+ resource "aws_ssm_parameter" "inspection_scoring_dlq_url" {
      + arn            = (known after apply)
      + data_type      = (known after apply)
      + has_value_wo   = (known after apply)
      + id             = (known after apply)
      + insecure_value = (known after apply)
      + key_id         = (known after apply)
      + name           = "/marketplace/prod/sqs/inspection-scoring-dlq-url"
      + tags           = {
          + "cost_center"  = "engineering"
          + "data_class"   = "internal"
          + "environment"  = "prod"
          + "owner"        = "platform@ryuqqq.com"
          + "project"      = "marketplace"
          + "service_name" = "marketplace-sqs"
          + "team"         = "platform-team"
        }
      + tags_all       = {
          + "Environment"  = "prod"
          + "ManagedBy"    = "terraform"
          + "Project"      = "marketplace"
          + "cost_center"  = "engineering"
          + "data_class"   = "internal"
          + "environment"  = "prod"
          + "owner"        = "platform@ryuqqq.com"
          + "project"      = "marketplace"
          + "service_name" = "marketplace-sqs"
          + "team"         = "platform-team"
        }
      + tier           = (known after apply)
      + type           = "String"
      + value          = (sensitive value)
      + version        = (known after apply)
    }

  # aws_ssm_parameter.inspection_scoring_queue_arn will be created
+ resource "aws_ssm_parameter" "inspection_scoring_queue_arn" {
      + arn            = (known after apply)
      + data_type      = (known after apply)
      + has_value_wo   = (known after apply)
      + id             = (known after apply)
      + insecure_value = (known after apply)
      + key_id         = (known after apply)
      + name           = "/marketplace/prod/sqs/inspection-scoring-queue-arn"
      + tags           = {
          + "cost_center"  = "engineering"
          + "data_class"   = "internal"
          + "environment"  = "prod"
          + "owner"        = "platform@ryuqqq.com"
          + "project"      = "marketplace"
          + "service_name" = "marketplace-sqs"
          + "team"         = "platform-team"
        }
      + tags_all       = {
          + "Environment"  = "prod"
          + "ManagedBy"    = "terraform"
          + "Project"      = "marketplace"
          + "cost_center"  = "engineering"
          + "data_class"   = "internal"
          + "environment"  = "prod"
          + "owner"        = "platform@ryuqqq.com"
          + "project"      = "marketplace"
          + "service_name" = "marketplace-sqs"
          + "team"         = "platform-team"
        }
      + tier           = (known after apply)
      + type           = "String"
      + value          = (sensitive value)
      + version        = (known after apply)
    }

  # aws_ssm_parameter.inspection_scoring_queue_url will be created
+ resource "aws_ssm_parameter" "inspection_scoring_queue_url" {
      + arn            = (known after apply)
      + data_type      = (known after apply)
      + has_value_wo   = (known after apply)
      + id             = (known after apply)
      + insecure_value = (known after apply)
      + key_id         = (known after apply)
      + name           = "/marketplace/prod/sqs/inspection-scoring-queue-url"
      + tags           = {
          + "cost_center"  = "engineering"
          + "data_class"   = "internal"
          + "environment"  = "prod"
          + "owner"        = "platform@ryuqqq.com"
          + "project"      = "marketplace"
          + "service_name" = "marketplace-sqs"
          + "team"         = "platform-team"
        }
      + tags_all       = {
          + "Environment"  = "prod"
          + "ManagedBy"    = "terraform"
          + "Project"      = "marketplace"
          + "cost_center"  = "engineering"
          + "data_class"   = "internal"
          + "environment"  = "prod"
          + "owner"        = "platform@ryuqqq.com"
          + "project"      = "marketplace"
          + "service_name" = "marketplace-sqs"
          + "team"         = "platform-team"
        }
      + tier           = (known after apply)
      + type           = "String"
      + value          = (sensitive value)
      + version        = (known after apply)
    }

  # aws_ssm_parameter.inspection_verification_dlq_url will be created
+ resource "aws_ssm_parameter" "inspection_verification_dlq_url" {
      + arn            = (known after apply)
      + data_type      = (known after apply)
      + has_value_wo   = (known after apply)
      + id             = (known after apply)
      + insecure_value = (known after apply)
      + key_id         = (known after apply)
      + name           = "/marketplace/prod/sqs/inspection-verification-dlq-url"
      + tags           = {
          + "cost_center"  = "engineering"
          + "data_class"   = "internal"
          + "environment"  = "prod"
          + "owner"        = "platform@ryuqqq.com"
          + "project"      = "marketplace"
          + "service_name" = "marketplace-sqs"
          + "team"         = "platform-team"
        }
      + tags_all       = {
          + "Environment"  = "prod"
          + "ManagedBy"    = "terraform"
          + "Project"      = "marketplace"
          + "cost_center"  = "engineering"
          + "data_class"   = "internal"
          + "environment"  = "prod"
          + "owner"        = "platform@ryuqqq.com"
          + "project"      = "marketplace"
          + "service_name" = "marketplace-sqs"
          + "team"         = "platform-team"
        }
      + tier           = (known after apply)
      + type           = "String"
      + value          = (sensitive value)
      + version        = (known after apply)
    }

  # aws_ssm_parameter.inspection_verification_queue_arn will be created
+ resource "aws_ssm_parameter" "inspection_verification_queue_arn" {
      + arn            = (known after apply)
      + data_type      = (known after apply)
      + has_value_wo   = (known after apply)
      + id             = (known after apply)
      + insecure_value = (known after apply)
      + key_id         = (known after apply)
      + name           = "/marketplace/prod/sqs/inspection-verification-queue-arn"
      + tags           = {
          + "cost_center"  = "engineering"
          + "data_class"   = "internal"
          + "environment"  = "prod"
          + "owner"        = "platform@ryuqqq.com"
          + "project"      = "marketplace"
          + "service_name" = "marketplace-sqs"
          + "team"         = "platform-team"
        }
      + tags_all       = {
          + "Environment"  = "prod"
          + "ManagedBy"    = "terraform"
          + "Project"      = "marketplace"
          + "cost_center"  = "engineering"
          + "data_class"   = "internal"
          + "environment"  = "prod"
          + "owner"        = "platform@ryuqqq.com"
          + "project"      = "marketplace"
          + "service_name" = "marketplace-sqs"
          + "team"         = "platform-team"
        }
      + tier           = (known after apply)
      + type           = "String"
      + value          = (sensitive value)
      + version        = (known after apply)
    }

  # aws_ssm_parameter.inspection_verification_queue_url will be created
+ resource "aws_ssm_parameter" "inspection_verification_queue_url" {
      + arn            = (known after apply)
      + data_type      = (known after apply)
      + has_value_wo   = (known after apply)
      + id             = (known after apply)
      + insecure_value = (known after apply)
      + key_id         = (known after apply)
      + name           = "/marketplace/prod/sqs/inspection-verification-queue-url"
      + tags           = {
          + "cost_center"  = "engineering"
          + "data_class"   = "internal"
          + "environment"  = "prod"
          + "owner"        = "platform@ryuqqq.com"
          + "project"      = "marketplace"
          + "service_name" = "marketplace-sqs"
          + "team"         = "platform-team"
        }
      + tags_all       = {
          + "Environment"  = "prod"
          + "ManagedBy"    = "terraform"
          + "Project"      = "marketplace"
          + "cost_center"  = "engineering"
          + "data_class"   = "internal"
          + "environment"  = "prod"
          + "owner"        = "platform@ryuqqq.com"
          + "project"      = "marketplace"
          + "service_name" = "marketplace-sqs"
          + "team"         = "platform-team"
        }
      + tier           = (known after apply)
      + type           = "String"
      + value          = (sensitive value)
      + version        = (known after apply)
    }

  # aws_ssm_parameter.intelligence_aggregation_queue_url will be created
+ resource "aws_ssm_parameter" "intelligence_aggregation_queue_url" {
      + arn            = (known after apply)
      + data_type      = (known after apply)
      + has_value_wo   = (known after apply)
      + id             = (known after apply)
      + insecure_value = (known after apply)
      + key_id         = (known after apply)
      + name           = "/marketplace/prod/sqs/intelligence-aggregation-queue-url"
      + tags           = {
          + "cost_center"  = "engineering"
          + "data_class"   = "internal"
          + "environment"  = "prod"
          + "owner"        = "platform@ryuqqq.com"
          + "project"      = "marketplace"
          + "service_name" = "marketplace-sqs"
          + "team"         = "platform-team"
        }
      + tags_all       = {
          + "Environment"  = "prod"
          + "ManagedBy"    = "terraform"
          + "Project"      = "marketplace"
          + "cost_center"  = "engineering"
          + "data_class"   = "internal"
          + "environment"  = "prod"
          + "owner"        = "platform@ryuqqq.com"
          + "project"      = "marketplace"
          + "service_name" = "marketplace-sqs"
          + "team"         = "platform-team"
        }
      + tier           = (known after apply)
      + type           = "String"
      + value          = (sensitive value)
      + version        = (known after apply)
    }

  # aws_ssm_parameter.intelligence_description_analysis_queue_url will be created
+ resource "aws_ssm_parameter" "intelligence_description_analysis_queue_url" {
      + arn            = (known after apply)
      + data_type      = (known after apply)
      + has_value_wo   = (known after apply)
      + id             = (known after apply)
      + insecure_value = (known after apply)
      + key_id         = (known after apply)
      + name           = "/marketplace/prod/sqs/intelligence-description-analysis-queue-url"
      + tags           = {
          + "cost_center"  = "engineering"
          + "data_class"   = "internal"
          + "environment"  = "prod"
          + "owner"        = "platform@ryuqqq.com"
          + "project"      = "marketplace"
          + "service_name" = "marketplace-sqs"
          + "team"         = "platform-team"
        }
      + tags_all       = {
          + "Environment"  = "prod"
          + "ManagedBy"    = "terraform"
          + "Project"      = "marketplace"
          + "cost_center"  = "engineering"
          + "data_class"   = "internal"
          + "environment"  = "prod"
          + "owner"        = "platform@ryuqqq.com"
          + "project"      = "marketplace"
          + "service_name" = "marketplace-sqs"
          + "team"         = "platform-team"
        }
      + tier           = (known after apply)
      + type           = "String"
      + value          = (sensitive value)
      + version        = (known after apply)
    }

  # aws_ssm_parameter.intelligence_notice_analysis_queue_url will be created
+ resource "aws_ssm_parameter" "intelligence_notice_analysis_queue_url" {
      + arn            = (known after apply)
      + data_type      = (known after apply)
      + has_value_wo   = (known after apply)
      + id             = (known after apply)
      + insecure_value = (known after apply)
      + key_id         = (known after apply)
      + name           = "/marketplace/prod/sqs/intelligence-notice-analysis-queue-url"
      + tags           = {
          + "cost_center"  = "engineering"
          + "data_class"   = "internal"
          + "environment"  = "prod"
          + "owner"        = "platform@ryuqqq.com"
          + "project"      = "marketplace"
          + "service_name" = "marketplace-sqs"
          + "team"         = "platform-team"
        }
      + tags_all       = {
          + "Environment"  = "prod"
          + "ManagedBy"    = "terraform"
          + "Project"      = "marketplace"
          + "cost_center"  = "engineering"
          + "data_class"   = "internal"
          + "environment"  = "prod"
          + "owner"        = "platform@ryuqqq.com"
          + "project"      = "marketplace"
          + "service_name" = "marketplace-sqs"
          + "team"         = "platform-team"
        }
      + tier           = (known after apply)
      + type           = "String"
      + value          = (sensitive value)
      + version        = (known after apply)
    }

  # aws_ssm_parameter.intelligence_option_analysis_queue_url will be created
+ resource "aws_ssm_parameter" "intelligence_option_analysis_queue_url" {
      + arn            = (known after apply)
      + data_type      = (known after apply)
      + has_value_wo   = (known after apply)
      + id             = (known after apply)
      + insecure_value = (known after apply)
      + key_id         = (known after apply)
      + name           = "/marketplace/prod/sqs/intelligence-option-analysis-queue-url"
      + tags           = {
          + "cost_center"  = "engineering"
          + "data_class"   = "internal"
          + "environment"  = "prod"
          + "owner"        = "platform@ryuqqq.com"
          + "project"      = "marketplace"
          + "service_name" = "marketplace-sqs"
          + "team"         = "platform-team"
        }
      + tags_all       = {
          + "Environment"  = "prod"
          + "ManagedBy"    = "terraform"
          + "Project"      = "marketplace"
          + "cost_center"  = "engineering"
          + "data_class"   = "internal"
          + "environment"  = "prod"
          + "owner"        = "platform@ryuqqq.com"
          + "project"      = "marketplace"
          + "service_name" = "marketplace-sqs"
          + "team"         = "platform-team"
        }
      + tier           = (known after apply)
      + type           = "String"
      + value          = (sensitive value)
      + version        = (known after apply)
    }

  # aws_ssm_parameter.intelligence_orchestration_queue_url will be created
+ resource "aws_ssm_parameter" "intelligence_orchestration_queue_url" {
      + arn            = (known after apply)
      + data_type      = (known after apply)
      + has_value_wo   = (known after apply)
      + id             = (known after apply)
      + insecure_value = (known after apply)
      + key_id         = (known after apply)
      + name           = "/marketplace/prod/sqs/intelligence-orchestration-queue-url"
      + tags           = {
          + "cost_center"  = "engineering"
          + "data_class"   = "internal"
          + "environment"  = "prod"
          + "owner"        = "platform@ryuqqq.com"
          + "project"      = "marketplace"
          + "service_name" = "marketplace-sqs"
          + "team"         = "platform-team"
        }
      + tags_all       = {
          + "Environment"  = "prod"
          + "ManagedBy"    = "terraform"
          + "Project"      = "marketplace"
          + "cost_center"  = "engineering"
          + "data_class"   = "internal"
          + "environment"  = "prod"
          + "owner"        = "platform@ryuqqq.com"
          + "project"      = "marketplace"
          + "service_name" = "marketplace-sqs"
          + "team"         = "platform-team"
        }
      + tier           = (known after apply)
      + type           = "String"
      + value          = (sensitive value)
      + version        = (known after apply)
    }

  # aws_ssm_parameter.outbound_sync_dlq_url will be created
+ resource "aws_ssm_parameter" "outbound_sync_dlq_url" {
      + arn            = (known after apply)
      + data_type      = (known after apply)
      + has_value_wo   = (known after apply)
      + id             = (known after apply)
      + insecure_value = (known after apply)
      + key_id         = (known after apply)
      + name           = "/marketplace/prod/sqs/outbound-sync-dlq-url"
      + tags           = {
          + "cost_center"  = "engineering"
          + "data_class"   = "internal"
          + "environment"  = "prod"
          + "owner"        = "platform@ryuqqq.com"
          + "project"      = "marketplace"
          + "service_name" = "marketplace-sqs"
          + "team"         = "platform-team"
        }
      + tags_all       = {
          + "Environment"  = "prod"
          + "ManagedBy"    = "terraform"
          + "Project"      = "marketplace"
          + "cost_center"  = "engineering"
          + "data_class"   = "internal"
          + "environment"  = "prod"
          + "owner"        = "platform@ryuqqq.com"
          + "project"      = "marketplace"
          + "service_name" = "marketplace-sqs"
          + "team"         = "platform-team"
        }
      + tier           = (known after apply)
      + type           = "String"
      + value          = (sensitive value)
      + version        = (known after apply)
    }

  # aws_ssm_parameter.outbound_sync_queue_arn will be created
+ resource "aws_ssm_parameter" "outbound_sync_queue_arn" {
      + arn            = (known after apply)
      + data_type      = (known after apply)
      + has_value_wo   = (known after apply)
      + id             = (known after apply)
      + insecure_value = (known after apply)
      + key_id         = (known after apply)
      + name           = "/marketplace/prod/sqs/outbound-sync-queue-arn"
      + tags           = {
          + "cost_center"  = "engineering"
          + "data_class"   = "internal"
          + "environment"  = "prod"
          + "owner"        = "platform@ryuqqq.com"
          + "project"      = "marketplace"
          + "service_name" = "marketplace-sqs"
          + "team"         = "platform-team"
        }
      + tags_all       = {
          + "Environment"  = "prod"
          + "ManagedBy"    = "terraform"
          + "Project"      = "marketplace"
          + "cost_center"  = "engineering"
          + "data_class"   = "internal"
          + "environment"  = "prod"
          + "owner"        = "platform@ryuqqq.com"
          + "project"      = "marketplace"
          + "service_name" = "marketplace-sqs"
          + "team"         = "platform-team"
        }
      + tier           = (known after apply)
      + type           = "String"
      + value          = (sensitive value)
      + version        = (known after apply)
    }

  # aws_ssm_parameter.outbound_sync_queue_url will be created
+ resource "aws_ssm_parameter" "outbound_sync_queue_url" {
      + arn            = (known after apply)
      + data_type      = (known after apply)
      + has_value_wo   = (known after apply)
      + id             = (known after apply)
      + insecure_value = (known after apply)
      + key_id         = (known after apply)
      + name           = "/marketplace/prod/sqs/outbound-sync-queue-url"
      + tags           = {
          + "cost_center"  = "engineering"
          + "data_class"   = "internal"
          + "environment"  = "prod"
          + "owner"        = "platform@ryuqqq.com"
          + "project"      = "marketplace"
          + "service_name" = "marketplace-sqs"
          + "team"         = "platform-team"
        }
      + tags_all       = {
          + "Environment"  = "prod"
          + "ManagedBy"    = "terraform"
          + "Project"      = "marketplace"
          + "cost_center"  = "engineering"
          + "data_class"   = "internal"
          + "environment"  = "prod"
          + "owner"        = "platform@ryuqqq.com"
          + "project"      = "marketplace"
          + "service_name" = "marketplace-sqs"
          + "team"         = "platform-team"
        }
      + tier           = (known after apply)
      + type           = "String"
      + value          = (sensitive value)
      + version        = (known after apply)
    }

  # aws_ssm_parameter.qna_outbox_queue_url will be created
+ resource "aws_ssm_parameter" "qna_outbox_queue_url" {
      + arn            = (known after apply)
      + data_type      = (known after apply)
      + has_value_wo   = (known after apply)
      + id             = (known after apply)
      + insecure_value = (known after apply)
      + key_id         = (known after apply)
      + name           = "/marketplace/prod/sqs/qna-outbox-queue-url"
      + tags           = {
          + "cost_center"  = "engineering"
          + "data_class"   = "internal"
          + "environment"  = "prod"
          + "owner"        = "platform@ryuqqq.com"
          + "project"      = "marketplace"
          + "service_name" = "marketplace-sqs"
          + "team"         = "platform-team"
        }
      + tags_all       = {
          + "Environment"  = "prod"
          + "ManagedBy"    = "terraform"
          + "Project"      = "marketplace"
          + "cost_center"  = "engineering"
          + "data_class"   = "internal"
          + "environment"  = "prod"
          + "owner"        = "platform@ryuqqq.com"
          + "project"      = "marketplace"
          + "service_name" = "marketplace-sqs"
          + "team"         = "platform-team"
        }
      + tier           = (known after apply)
      + type           = "String"
      + value          = (sensitive value)
      + version        = (known after apply)
    }

  # aws_ssm_parameter.refund_outbox_queue_url will be created
+ resource "aws_ssm_parameter" "refund_outbox_queue_url" {
      + arn            = (known after apply)
      + data_type      = (known after apply)
      + has_value_wo   = (known after apply)
      + id             = (known after apply)
      + insecure_value = (known after apply)
      + key_id         = (known after apply)
      + name           = "/marketplace/prod/sqs/refund-outbox-queue-url"
      + tags           = {
          + "cost_center"  = "engineering"
          + "data_class"   = "internal"
          + "environment"  = "prod"
          + "owner"        = "platform@ryuqqq.com"
          + "project"      = "marketplace"
          + "service_name" = "marketplace-sqs"
          + "team"         = "platform-team"
        }
      + tags_all       = {
          + "Environment"  = "prod"
          + "ManagedBy"    = "terraform"
          + "Project"      = "marketplace"
          + "cost_center"  = "engineering"
          + "data_class"   = "internal"
          + "environment"  = "prod"
          + "owner"        = "platform@ryuqqq.com"
          + "project"      = "marketplace"
          + "service_name" = "marketplace-sqs"
          + "team"         = "platform-team"
        }
      + tier           = (known after apply)
      + type           = "String"
      + value          = (sensitive value)
      + version        = (known after apply)
    }

  # aws_ssm_parameter.sqs_access_policy_arn will be created
+ resource "aws_ssm_parameter" "sqs_access_policy_arn" {
      + arn            = (known after apply)
      + data_type      = (known after apply)
      + has_value_wo   = (known after apply)
      + id             = (known after apply)
      + insecure_value = (known after apply)
      + key_id         = (known after apply)
      + name           = "/marketplace/prod/sqs/access-policy-arn"
      + tags           = {
          + "cost_center"  = "engineering"
          + "data_class"   = "internal"
          + "environment"  = "prod"
          + "owner"        = "platform@ryuqqq.com"
          + "project"      = "marketplace"
          + "service_name" = "marketplace-sqs"
          + "team"         = "platform-team"
        }
      + tags_all       = {
          + "Environment"  = "prod"
          + "ManagedBy"    = "terraform"
          + "Project"      = "marketplace"
          + "cost_center"  = "engineering"
          + "data_class"   = "internal"
          + "environment"  = "prod"
          + "owner"        = "platform@ryuqqq.com"
          + "project"      = "marketplace"
          + "service_name" = "marketplace-sqs"
          + "team"         = "platform-team"
        }
      + tier           = (known after apply)
      + type           = "String"
      + value          = (sensitive value)
      + version        = (known after apply)
    }

Plan: 22 to add, 0 to change, 0 to destroy.
```
</details>

* :arrow_forward: To **apply** this plan, comment:
  ```shell
  atlantis apply -p marketplace-sqs-prod
  ```
* :put_litter_in_its_place: To **delete** this plan and lock, click [here](https://atlantis.set-of.com/lock?id=ryu-qqq%252FMarketPlace%252Fterraform%252Fenvironments%252Fprod%252Fsqs%252Fdefault)
* :repeat: To **plan** this project again, comment:
  ```shell
  atlantis plan -p marketplace-sqs-prod
  ```
Plan: 22 to add, 0 to change, 0 to destroy.

---
### 3. project: `marketplace-ecs-worker-prod` dir: `terraform/environments/prod/ecs-worker` workspace: `default`
**Plan Error**
<details><summary>Show Output</summary>

```
running "/home/atlantis/.atlantis/bin/terraform1.8.1 plan -input=false -refresh -out \"/home/atlantis/.atlantis/repos/ryu-qqq/MarketPlace/51/default/terraform/environments/prod/ecs-worker/marketplace-ecs-worker-prod-default.tfplan\"" in "/home/atlantis/.atlantis/repos/ryu-qqq/MarketPlace/51/default/terraform/environments/prod/ecs-worker": exit status 1
data.aws_ssm_parameter.sqs_scoring_queue_url: Reading...
data.aws_ssm_parameter.sqs_enhancement_queue_url: Reading...
data.aws_ssm_parameter.sqs_intelligence_option_analysis_queue_url: Reading...
data.aws_ssm_parameter.sentry_dsn: Reading...
data.aws_ssm_parameter.sqs_refund_outbox_queue_url: Reading...
data.aws_ssm_parameter.openai_api_key: Reading...
module.ecs_service.data.aws_region.current: Reading...
data.aws_ssm_parameter.authhub_service_token: Reading...
data.aws_caller_identity.current: Reading...
module.ecs_service.data.aws_region.current: Read complete after 0s [id=ap-northeast-2]
data.aws_ssm_parameter.rds_proxy_endpoint: Reading...
module.worker_task_role.aws_iam_role.this: Refreshing state... [id=marketplace-worker-task-role-prod]
data.aws_caller_identity.current: Read complete after 0s [id=646886795421]
data.aws_ssm_parameter.sqs_intelligence_description_analysis_queue_url: Reading...
module.worker_task_execution_role.data.aws_caller_identity.current: Reading...
data.aws_ssm_parameter.rds_proxy_endpoint: Read complete after 0s [id=/shared/rds/proxy-endpoint]
module.worker_task_execution_role.data.aws_caller_identity.current: Read complete after 0s [id=646886795421]
module.ecs_service.data.aws_caller_identity.current: Reading...
module.worker_task_role.data.aws_region.current: Reading...
data.aws_ssm_parameter.sqs_exchange_outbox_queue_url: Reading...
data.aws_ssm_parameter.vpc_id: Reading...
data.aws_ssm_parameter.sqs_verification_queue_url: Reading...
module.worker_task_role.data.aws_caller_identity.current: Reading...
module.worker_task_role.data.aws_region.current: Read complete after 0s [id=ap-northeast-2]
data.aws_ssm_parameter.private_subnets: Reading...
data.aws_ssm_parameter.sentry_dsn: Read complete after 0s [id=/marketplace/sentry/dsn]
data.aws_ssm_parameter.fileflow_service_token: Reading...
module.ecs_service.data.aws_caller_identity.current: Read complete after 0s [id=646886795421]
data.aws_ssm_parameter.sqs_outbound_sync_queue_url: Reading...
data.aws_ssm_parameter.authhub_service_token: Read complete after 0s [id=/authhub/security/service-token-secret]
data.aws_ecs_cluster.main: Reading...
data.aws_ssm_parameter.openai_api_key: Read complete after 0s [id=/marketplace/openai/api-key]
data.aws_ssm_parameter.naver_commerce_client_secret: Reading...
module.worker_task_role.data.aws_caller_identity.current: Read complete after 0s [id=646886795421]
data.aws_ssm_parameter.amp_remote_write_url: Reading...
data.aws_ssm_parameter.private_subnets: Read complete after 0s [id=/shared/network/private-subnets]
data.aws_ssm_parameter.sqs_intelligence_aggregation_queue_url: Reading...
data.aws_ssm_parameter.vpc_id: Read complete after 0s [id=/shared/network/vpc-id]
data.aws_ssm_parameter.sqs_intelligence_notice_analysis_queue_url: Reading...
data.aws_ssm_parameter.sqs_access_policy_arn: Reading...
data.aws_ssm_parameter.naver_commerce_client_id: Reading...
data.aws_ssm_parameter.amp_remote_write_url: Read complete after 0s [id=/shared/monitoring/amp-remote-write-url]
data.aws_ssm_parameter.legacy_db_password: Reading...
data.aws_ssm_parameter.amp_workspace_arn: Reading...
data.aws_ssm_parameter.sqs_qna_outbox_queue_url: Reading...
data.aws_ssm_parameter.sqs_cancel_outbox_queue_url: Reading...
data.aws_secretsmanager_secret.rds: Reading...
data.aws_ssm_parameter.naver_commerce_client_secret: Read complete after 0s [id=/naver-commerce/prod/client-secret]
data.aws_ssm_parameter.sqs_intelligence_orchestration_queue_url: Reading...
data.aws_ssm_parameter.fileflow_service_token: Read complete after 0s [id=/shared/security/service-token-secret]
module.worker_task_execution_role.aws_iam_role.this: Refreshing state... [id=marketplace-worker-execution-role-prod]
data.aws_ssm_parameter.naver_commerce_client_id: Read complete after 0s [id=/naver-commerce/prod/client-id]
module.worker_task_execution_role.data.aws_region.current: Reading...
module.worker_task_execution_role.data.aws_region.current: Read complete after 0s [id=ap-northeast-2]
data.aws_ecr_repository.worker: Reading...
data.aws_ssm_parameter.amp_workspace_arn: Read complete after 0s [id=/shared/monitoring/amp-workspace-arn]
data.aws_ecs_cluster.main: Read complete after 0s [id=arn:aws:ecs:ap-northeast-2:646886795421:cluster/marketplace-cluster-prod]
aws_kms_key.logs: Refreshing state... [id=1f0c0d10-1a78-47c8-82c6-436f6a28b901]
data.aws_vpc.main: Reading...
module.ecs_security_group.aws_security_group.this: Refreshing state... [id=sg-0c6e20e8635f53cfc]
data.aws_ssm_parameter.legacy_db_password: Read complete after 0s [id=/marketplace/prod/legacy-db-password]
data.aws_secretsmanager_secret.rds: Read complete after 0s [id=arn:aws:secretsmanager:ap-northeast-2:646886795421:secret:marketplace/rds/credentials-MGeUIP]
data.aws_secretsmanager_secret_version.rds: Reading...
data.aws_secretsmanager_secret_version.rds: Read complete after 1s [id=arn:aws:secretsmanager:ap-northeast-2:646886795421:secret:marketplace/rds/credentials-MGeUIP|AWSCURRENT]
aws_kms_alias.logs: Refreshing state... [id=alias/marketplace-worker-logs-prod]
module.worker_logs.aws_cloudwatch_log_group.this: Refreshing state... [id=/aws/ecs/marketplace-worker-prod/application]
module.ecs_security_group.aws_vpc_security_group_egress_rule.default[0]: Refreshing state... [id=sgr-0335ce31c62841f10]
data.aws_ecr_repository.worker: Read complete after 1s [id=marketplace-worker-prod]
data.aws_vpc.main: Read complete after 1s
module.ecs_security_group.aws_vpc_security_group_ingress_rule.custom["0"]: Refreshing state... [id=sgr-07c65153a614f27e9]
module.worker_task_role.aws_iam_role_policy.custom["adot-amp-access"]: Refreshing state... [id=marketplace-worker-task-role-prod:marketplace-worker-task-role-prod-adot-amp-access]
module.worker_task_execution_role.aws_iam_role_policy.secrets-manager[0]: Refreshing state... [id=marketplace-worker-execution-role-prod:marketplace-worker-execution-role-prod-secrets-manager]
module.worker_task_execution_role.aws_iam_role_policy.custom["ssm-access"]: Refreshing state... [id=marketplace-worker-execution-role-prod:marketplace-worker-execution-role-prod-ssm-access]
module.worker_task_execution_role.aws_iam_role_policy_attachment.aws-managed["arn:aws:iam::aws:policy/service-role/AmazonECSTaskExecutionRolePolicy"]: Refreshing state... [id=marketplace-worker-execution-role-prod-20260219022926699200000001]

Planning failed. Terraform encountered an error while generating this plan.

╷
│ Error: reading SSM Parameter (/marketplace/prod/sqs/inspection-scoring-queue-url): couldn't find resource
│ 
│   with data.aws_ssm_parameter.sqs_scoring_queue_url,
│   on provider.tf line 148, in data "aws_ssm_parameter" "sqs_scoring_queue_url":
│  148: data "aws_ssm_parameter" "sqs_scoring_queue_url" {
│ 
╵
╷
│ Error: reading SSM Parameter (/marketplace/prod/sqs/inspection-enhancement-queue-url): couldn't find resource
│ 
│   with data.aws_ssm_parameter.sqs_enhancement_queue_url,
│   on provider.tf line 152, in data "aws_ssm_parameter" "sqs_enhancement_queue_url":
│  152: data "aws_ssm_parameter" "sqs_enhancement_queue_url" {
│ 
╵
╷
│ Error: reading SSM Parameter (/marketplace/prod/sqs/inspection-verification-queue-url): couldn't find resource
│ 
│   with data.aws_ssm_parameter.sqs_verification_queue_url,
│   on provider.tf line 156, in data "aws_ssm_parameter" "sqs_verification_queue_url":
│  156: data "aws_ssm_parameter" "sqs_verification_queue_url" {
│ 
╵
╷
│ Error: reading SSM Parameter (/marketplace/prod/sqs/access-policy-arn): couldn't find resource
│ 
│   with data.aws_ssm_parameter.sqs_access_policy_arn,
│   on provider.tf line 160, in data "aws_ssm_parameter" "sqs_access_policy_arn":
│  160: data "aws_ssm_parameter" "sqs_access_policy_arn" {
│ 
╵
╷
│ Error: reading SSM Parameter (/marketplace/prod/sqs/outbound-sync-queue-url): couldn't find resource
│ 
│   with data.aws_ssm_parameter.sqs_outbound_sync_queue_url,
│   on provider.tf line 167, in data "aws_ssm_parameter" "sqs_outbound_sync_queue_url":
│  167: data "aws_ssm_parameter" "sqs_outbound_sync_queue_url" {
│ 
╵
╷
│ Error: reading SSM Parameter (/marketplace/prod/sqs/intelligence-orchestration-queue-url): couldn't find resource
│ 
│   with data.aws_ssm_parameter.sqs_intelligence_orchestration_queue_url,
│   on provider.tf line 174, in data "aws_ssm_parameter" "sqs_intelligence_orchestration_queue_url":
│  174: data "aws_ssm_parameter" "sqs_intelligence_orchestration_queue_url" {
│ 
╵
╷
│ Error: reading SSM Parameter (/marketplace/prod/sqs/intelligence-description-analysis-queue-url): couldn't find resource
│ 
│   with data.aws_ssm_parameter.sqs_intelligence_description_analysis_queue_url,
│   on provider.tf line 178, in data "aws_ssm_parameter" "sqs_intelligence_description_analysis_queue_url":
│  178: data "aws_ssm_parameter" "sqs_intelligence_description_analysis_queue_url" {
│ 
╵
╷
│ Error: reading SSM Parameter (/marketplace/prod/sqs/intelligence-option-analysis-queue-url): couldn't find resource
│ 
│   with data.aws_ssm_parameter.sqs_intelligence_option_analysis_queue_url,
│   on provider.tf line 182, in data "aws_ssm_parameter" "sqs_intelligence_option_analysis_queue_url":
│  182: data "aws_ssm_parameter" "sqs_intelligence_option_analysis_queue_url" {
│ 
╵
╷
│ Error: reading SSM Parameter (/marketplace/prod/sqs/intelligence-notice-analysis-queue-url): couldn't find resource
│ 
│   with data.aws_ssm_parameter.sqs_intelligence_notice_analysis_queue_url,
│   on provider.tf line 186, in data "aws_ssm_parameter" "sqs_intelligence_notice_analysis_queue_url":
│  186: data "aws_ssm_parameter" "sqs_intelligence_notice_analysis_queue_url" {
│ 
╵
╷
│ Error: reading SSM Parameter (/marketplace/prod/sqs/intelligence-aggregation-queue-url): couldn't find resource
│ 
│   with data.aws_ssm_parameter.sqs_intelligence_aggregation_queue_url,
│   on provider.tf line 190, in data "aws_ssm_parameter" "sqs_intelligence_aggregation_queue_url":
│  190: data "aws_ssm_parameter" "sqs_intelligence_aggregation_queue_url" {
│ 
╵
╷
│ Error: reading SSM Parameter (/marketplace/prod/sqs/cancel-outbox-queue-url): couldn't find resource
│ 
│   with data.aws_ssm_parameter.sqs_cancel_outbox_queue_url,
│   on provider.tf line 197, in data "aws_ssm_parameter" "sqs_cancel_outbox_queue_url":
│  197: data "aws_ssm_parameter" "sqs_cancel_outbox_queue_url" {
│ 
╵
╷
│ Error: reading SSM Parameter (/marketplace/prod/sqs/refund-outbox-queue-url): couldn't find resource
│ 
│   with data.aws_ssm_parameter.sqs_refund_outbox_queue_url,
│   on provider.tf line 201, in data "aws_ssm_parameter" "sqs_refund_outbox_queue_url":
│  201: data "aws_ssm_parameter" "sqs_refund_outbox_queue_url" {
│ 
╵
╷
│ Error: reading SSM Parameter (/marketplace/prod/sqs/exchange-outbox-queue-url): couldn't find resource
│ 
│   with data.aws_ssm_parameter.sqs_exchange_outbox_queue_url,
│   on provider.tf line 205, in data "aws_ssm_parameter" "sqs_exchange_outbox_queue_url":
│  205: data "aws_ssm_parameter" "sqs_exchange_outbox_queue_url" {
│ 
╵
╷
│ Error: reading SSM Parameter (/marketplace/prod/sqs/qna-outbox-queue-url): couldn't find resource
│ 
│   with data.aws_ssm_parameter.sqs_qna_outbox_queue_url,
│   on provider.tf line 209, in data "aws_ssm_parameter" "sqs_qna_outbox_queue_url":
│  209: data "aws_ssm_parameter" "sqs_qna_outbox_queue_url" {
│ 
╵


```
</details>

---
### 4. project: `marketplace-ecs-scheduler-stage` dir: `terraform/environments/stage/ecs-scheduler` workspace: `default`
**Plan Error**
<details><summary>Show Output</summary>

```
running "/home/atlantis/.atlantis/bin/terraform1.8.1 plan -input=false -refresh -out \"/home/atlantis/.atlantis/repos/ryu-qqq/MarketPlace/51/default/terraform/environments/stage/ecs-scheduler/marketplace-ecs-scheduler-stage-default.tfplan\"" in "/home/atlantis/.atlantis/repos/ryu-qqq/MarketPlace/51/default/terraform/environments/stage/ecs-scheduler": exit status 1
data.aws_ecs_cluster.main: Reading...
data.aws_ssm_parameter.sqs_qna_outbox_queue_url: Reading...
data.aws_db_instance.staging_rds: Reading...
data.aws_ssm_parameter.openai_api_key: Reading...
data.aws_ssm_parameter.sqs_cancel_outbox_queue_url: Reading...
data.aws_ssm_parameter.ses_sender_email: Reading...
data.aws_ssm_parameter.legacy_db_password: Reading...
module.scheduler_task_role.data.aws_region.current: Reading...
data.aws_ssm_parameter.authhub_service_token: Reading...
data.aws_secretsmanager_secret.rds: Reading...
module.scheduler_task_role.data.aws_region.current: Read complete after 0s [id=ap-northeast-2]
data.aws_ssm_parameter.vpc_id: Reading...
data.aws_ssm_parameter.vpc_id: Read complete after 1s [id=/shared/network/vpc-id]
data.aws_ssm_parameter.sqs_intelligence_description_analysis_queue_url: Reading...
data.aws_ssm_parameter.naver_commerce_client_secret: Reading...
data.aws_ecr_repository.scheduler: Reading...
data.aws_secretsmanager_secret.rds: Read complete after 1s [id=arn:aws:secretsmanager:ap-northeast-2:646886795421:secret:setof-commerce/rds/staging-credentials-hhmFwn]
data.aws_ssm_parameter.ses_sender_email: Read complete after 1s [id=/marketplace/ses/sender-email]
data.aws_ssm_parameter.authhub_service_token: Read complete after 1s [id=/authhub/stage/security/service-token-secret]
data.aws_ssm_parameter.legacy_db_password: Read complete after 1s [id=/marketplace/stage/legacy-db-password]
data.aws_ssm_parameter.service_discovery_namespace_id: Reading...
data.aws_ecs_cluster.main: Read complete after 1s [id=arn:aws:ecs:ap-northeast-2:646886795421:cluster/marketplace-cluster-stage]
module.scheduler_task_role.aws_iam_role.this: Refreshing state... [id=marketplace-scheduler-task-role-stage]
module.scheduler_task_execution_role.data.aws_region.current: Reading...
module.scheduler_task_execution_role.data.aws_caller_identity.current: Reading...
data.aws_ssm_parameter.openai_api_key: Read complete after 1s [id=/marketplace/openai/api-key]
module.scheduler_task_execution_role.aws_iam_role.this: Refreshing state... [id=marketplace-scheduler-execution-role-stage]
module.ecs_service.data.aws_caller_identity.current: Reading...
module.scheduler_task_execution_role.data.aws_region.current: Read complete after 0s [id=ap-northeast-2]
module.ecs_service.data.aws_region.current: Reading...
module.ecs_service.data.aws_region.current: Read complete after 0s [id=ap-northeast-2]
data.aws_ssm_parameter.rds_proxy_endpoint: Reading...
data.aws_ssm_parameter.sqs_shipment_outbox_queue_url: Reading...
module.scheduler_task_execution_role.data.aws_caller_identity.current: Read complete after 0s [id=646886795421]
data.aws_ssm_parameter.sqs_intelligence_notice_analysis_queue_url: Reading...
data.aws_ssm_parameter.service_discovery_namespace_id: Read complete after 0s [id=/shared/service-discovery/namespace-id]
data.aws_caller_identity.current: Reading...
module.ecs_service.data.aws_caller_identity.current: Read complete after 0s [id=646886795421]
data.aws_ssm_parameter.naver_commerce_client_secret: Read complete after 0s [id=/naver-commerce/stage/client-secret]
data.aws_ssm_parameter.private_subnets: Reading...
data.aws_ssm_parameter.amp_remote_write_url: Reading...
data.aws_caller_identity.current: Read complete after 0s [id=646886795421]
data.aws_ssm_parameter.sentry_dsn: Reading...
data.aws_ssm_parameter.sqs_refund_outbox_queue_url: Reading...
data.aws_ssm_parameter.amp_remote_write_url: Read complete after 0s [id=/shared/monitoring/amp-remote-write-url]
data.aws_ssm_parameter.rds_proxy_endpoint: Read complete after 0s [id=/shared/rds/staging-proxy-endpoint]
data.aws_ssm_parameter.sqs_exchange_outbox_queue_url: Reading...
data.aws_ssm_parameter.private_subnets: Read complete after 0s [id=/shared/network/private-subnets]
data.aws_ssm_parameter.sqs_intelligence_orchestration_queue_url: Reading...
module.scheduler_task_role.data.aws_caller_identity.current: Reading...
data.aws_ssm_parameter.sellic_api_key: Reading...
data.aws_ssm_parameter.sqs_intelligence_aggregation_queue_url: Reading...
data.aws_ssm_parameter.sentry_dsn: Read complete after 0s [id=/marketplace/sentry/dsn]
data.aws_ssm_parameter.fileflow_service_token: Reading...
module.scheduler_task_role.data.aws_caller_identity.current: Read complete after 0s [id=646886795421]
data.aws_ssm_parameter.sellic_api_key: Read complete after 0s [id=/marketplace/sellic/api-key]
data.aws_ssm_parameter.naver_commerce_client_id: Reading...
data.aws_ssm_parameter.sqs_intelligence_option_analysis_queue_url: Reading...
data.aws_ssm_parameter.amp_workspace_arn: Reading...
data.aws_ssm_parameter.anthropic_api_key: Reading...
data.aws_secretsmanager_secret_version.rds: Reading...
data.aws_ssm_parameter.fileflow_service_token: Read complete after 0s [id=/shared/security/service-token-secret]
data.aws_ssm_parameter.amp_workspace_arn: Read complete after 0s [id=/shared/monitoring/amp-workspace-arn]
aws_kms_key.logs: Refreshing state... [id=667039cf-f3ee-4c0f-8cd1-cc40f325cff8]
data.aws_vpc.main: Reading...
data.aws_ssm_parameter.naver_commerce_client_id: Read complete after 0s [id=/naver-commerce/stage/client-id]
data.aws_secretsmanager_secret_version.rds: Read complete after 0s [id=arn:aws:secretsmanager:ap-northeast-2:646886795421:secret:setof-commerce/rds/staging-credentials-hhmFwn|AWSCURRENT]
module.ecs_service.aws_service_discovery_service.this[0]: Refreshing state... [id=srv-qd3jchuir76l6ckq]
module.ecs_security_group.aws_security_group.this: Refreshing state... [id=sg-02e7d88f245a3dc27]
data.aws_ssm_parameter.anthropic_api_key: Read complete after 0s [id=/marketplace/anthropic/api-key]
data.aws_db_instance.staging_rds: Read complete after 1s [id=staging-shared-mysql]
module.scheduler_logs.aws_cloudwatch_log_group.this: Refreshing state... [id=/aws/ecs/marketplace-scheduler-stage/application]
aws_kms_alias.logs: Refreshing state... [id=alias/marketplace-scheduler-logs-stage]
module.ecs_security_group.aws_vpc_security_group_egress_rule.default[0]: Refreshing state... [id=sgr-00e78a2876ca6e713]
aws_security_group_rule.ecs_to_rds: Refreshing state... [id=sgrule-838715407]
data.aws_vpc.main: Read complete after 0s
module.ecs_security_group.aws_vpc_security_group_ingress_rule.custom["0"]: Refreshing state... [id=sgr-0091ff368e67580b6]
data.aws_ecr_repository.scheduler: Read complete after 0s [id=marketplace-scheduler-stage]
module.scheduler_task_execution_role.aws_iam_role_policy.secrets-manager[0]: Refreshing state... [id=marketplace-scheduler-execution-role-stage:marketplace-scheduler-execution-role-stage-secrets-manager]
module.scheduler_task_execution_role.aws_iam_role_policy.custom["ssm-access"]: Refreshing state... [id=marketplace-scheduler-execution-role-stage:marketplace-scheduler-execution-role-stage-ssm-access]
module.scheduler_task_execution_role.aws_iam_role_policy_attachment.aws-managed["arn:aws:iam::aws:policy/service-role/AmazonECSTaskExecutionRolePolicy"]: Refreshing state... [id=marketplace-scheduler-execution-role-stage-20260207055329120700000002]
module.scheduler_task_role.aws_iam_role_policy.custom["adot-amp-access"]: Refreshing state... [id=marketplace-scheduler-task-role-stage:marketplace-scheduler-task-role-stage-adot-amp-access]
module.scheduler_task_role.aws_iam_role_policy.custom["sqs-access"]: Refreshing state... [id=marketplace-scheduler-task-role-stage:marketplace-scheduler-task-role-stage-sqs-access]
module.scheduler_task_role.aws_iam_role_policy.custom["ses-access"]: Refreshing state... [id=marketplace-scheduler-task-role-stage:marketplace-scheduler-task-role-stage-ses-access]

Planning failed. Terraform encountered an error while generating this plan.

╷
│ Error: reading SSM Parameter (/marketplace/stage/sqs/intelligence-orchestration-queue-url): couldn't find resource
│ 
│   with data.aws_ssm_parameter.sqs_intelligence_orchestration_queue_url,
│   on provider.tf line 169, in data "aws_ssm_parameter" "sqs_intelligence_orchestration_queue_url":
│  169: data "aws_ssm_parameter" "sqs_intelligence_orchestration_queue_url" {
│ 
╵
╷
│ Error: reading SSM Parameter (/marketplace/stage/sqs/intelligence-description-analysis-queue-url): couldn't find resource
│ 
│   with data.aws_ssm_parameter.sqs_intelligence_description_analysis_queue_url,
│   on provider.tf line 173, in data "aws_ssm_parameter" "sqs_intelligence_description_analysis_queue_url":
│  173: data "aws_ssm_parameter" "sqs_intelligence_description_analysis_queue_url" {
│ 
╵
╷
│ Error: reading SSM Parameter (/marketplace/stage/sqs/intelligence-option-analysis-queue-url): couldn't find resource
│ 
│   with data.aws_ssm_parameter.sqs_intelligence_option_analysis_queue_url,
│   on provider.tf line 177, in data "aws_ssm_parameter" "sqs_intelligence_option_analysis_queue_url":
│  177: data "aws_ssm_parameter" "sqs_intelligence_option_analysis_queue_url" {
│ 
╵
╷
│ Error: reading SSM Parameter (/marketplace/stage/sqs/intelligence-notice-analysis-queue-url): couldn't find resource
│ 
│   with data.aws_ssm_parameter.sqs_intelligence_notice_analysis_queue_url,
│   on provider.tf line 181, in data "aws_ssm_parameter" "sqs_intelligence_notice_analysis_queue_url":
│  181: data "aws_ssm_parameter" "sqs_intelligence_notice_analysis_queue_url" {
│ 
╵
╷
�
```
</details>
<br>

**Warning**: Output length greater than max comment size. Continued in next comment.